# Importing pandas library

In [1]:
import pandas as pd

# 1. Create a list consists of ten names. Use the list to store the list elements in DataFrame. Display the created dataframe.

In [2]:
l=['PIYUSH','KAMLESH','RAGHU','PRIYA','JAYESH','RAM','ARJUN','BHARAT','BHIM','SAI']
df=pd.DataFrame(l)
print(df)

         0
0   PIYUSH
1  KAMLESH
2    RAGHU
3    PRIYA
4   JAYESH
5      RAM
6    ARJUN
7   BHARAT
8     BHIM
9      SAI

# 2. Create DataFrame from Dictionary which is consists of lists. Create following dictionary consists of three keys and each of them contain corresponding list of values.

In [3]:
d = {'Student': ['Rutvik', 'Pankti', 'Evaan', 'Dhyan'], 
        'City': ['Pune', 'Delhi', 'Surat', 'Houston'], 
         'Age': [22, 16, 5, 13]} 
print('success')

success

# 3. Store above dictionary in dataframe and display the created dataframe.

In [4]:
df=pd.DataFrame(d)
df

  Student     City  Age
0  Rutvik     Pune   22
1  Pankti    Delhi   16
2   Evaan    Surat    5
3   Dhyan  Houston   13